results-shopcart-harness_2_0_0-jvm-shenandoah-run/result-2026-01-05-18:26:12/wrk2_results_20260105_182614.txt
Running 30s test @ http://shopcart:8001
  16 threads and 16 connections
  Thread calibration: mean lat.: 1.987ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.096ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.863ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.006ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.830ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.913ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.823ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.874ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.694ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.754ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.696ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.641ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.671ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.576ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.566ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.611ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.28ms  413.05us   3.06ms   67.43%
    Req/Sec    52.82     52.49   111.00     78.26%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.27ms
 75.000%    1.55ms
 90.000%    1.82ms
 99.000%    2.31ms
 99.900%    2.59ms
 99.990%    2.82ms
 99.999%    3.06ms
100.000%    3.06ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.197     0.000000            1         1.00
       0.751     0.100000         1606         1.11
       0.912     0.200000         3202         1.25
       1.041     0.300000         4793         1.43
       1.158     0.400000         6393         1.67
       1.269     0.500000         7996         2.00
       1.325     0.550000         8784         2.22
       1.379     0.600000         9588         2.50
       1.433     0.650000        10395         2.86
       1.489     0.700000        11181         3.33
       1.551     0.750000        11985         4.00
       1.585     0.775000        12377         4.44
       1.624     0.800000        12785         5.00
       1.664     0.825000        13183         5.71
       1.706     0.850000        13577         6.67
       1.759     0.875000        13976         8.00
       1.788     0.887500        14174         8.89
       1.822     0.900000        14376        10.00
       1.858     0.912500        14575        11.43
       1.899     0.925000        14774        13.33
       1.944     0.937500        14973        16.00
       1.975     0.943750        15074        17.78
       2.003     0.950000        15172        20.00
       2.036     0.956250        15272        22.86
       2.069     0.962500        15380        26.67
       2.111     0.968750        15480        32.00
       2.131     0.971875        15521        35.56
       2.155     0.975000        15573        40.00
       2.179     0.978125        15622        45.71
       2.207     0.981250        15674        53.33
       2.237     0.984375        15721        64.00
       2.255     0.985938        15746        71.11
       2.275     0.987500        15775        80.00
       2.297     0.989062        15797        91.43
       2.325     0.990625        15823       106.67
       2.365     0.992188        15846       128.00
       2.379     0.992969        15859       142.22
       2.391     0.993750        15871       160.00
       2.409     0.994531        15883       182.86
       2.441     0.995313        15900       213.33
       2.461     0.996094        15908       256.00
       2.477     0.996484        15914       284.44
       2.485     0.996875        15922       320.00
       2.491     0.997266        15927       365.71
       2.509     0.997656        15933       426.67
       2.525     0.998047        15939       512.00
       2.533     0.998242        15942       568.89
       2.553     0.998437        15946       640.00
       2.563     0.998633        15950       731.43
       2.571     0.998828        15952       853.33
       2.595     0.999023        15955      1024.00
       2.601     0.999121        15956      1137.78
       2.623     0.999219        15958      1280.00
       2.659     0.999316        15960      1462.86
       2.669     0.999414        15961      1706.67
       2.721     0.999512        15964      2048.00
       2.721     0.999561        15964      2275.56
       2.721     0.999609        15964      2560.00
       2.725     0.999658        15965      2925.71
       2.727     0.999707        15966      3413.33
       2.759     0.999756        15967      4096.00
       2.759     0.999780        15967      4551.11
       2.759     0.999805        15967      5120.00
       2.821     0.999829        15968      5851.43
       2.821     0.999854        15968      6826.67
       2.885     0.999878        15969      8192.00
       2.885     0.999890        15969      9102.22
       2.885     0.999902        15969     10240.00
       2.885     0.999915        15969     11702.86
       2.885     0.999927        15969     13653.33
       3.063     0.999939        15970     16384.00
       3.063     1.000000        15970          inf
#[Mean    =        1.282, StdDeviation   =        0.413]
#[Max     =        3.062, Total count    =        15970]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  24002 requests in 29.97s, 11.24MB read
  Non-2xx or 3xx responses: 11961
Requests/sec:    800.91
Transfer/sec:    384.18KB

--- RESPONSE STATUS HISTOGRAM ---
Total requests: 0
Total errors (4xx/5xx): 0

Status code distribution:

Histogram data written to: /wrktemp/results/response_histogram.json